# В google colab добавить: !pip install pyTelegramBotAPI
# Чтобы добавить новое слово — нужно его прописать в массиве DEFINITOINS на 11 строчке
# Важно все новые аббривиатуры в коде писать только с маленьких букв
# Пользователь в телеграм может писать и с большой и с маленькой — код всегда приводит к строчным

from telebot import TeleBot, types

bot = TeleBot(token='Вставте свой токен', parse_mode='html') # создание бота

# словарь с определениями и аббревиатурами, которые знает бот
# в формате:
# 'ключевая фраза': 'соответствующее ей определение'
DEFINITOINS = {
    'джокер': 'Единственное преступление, которое я не могу себе позволить, — это убивать время на регрес',
    'бетмен': 'Все люди падают. Главное встать на ноги и пойти завести баг-репорт',
    'робин': 'Вселенная огромна, и ты не знаешь кто в ней живет. Даже если ты последний… помни, ты QA Engineer',
    'тор' : 'Мы - супергерои - тестировщики. Работа у нас нервная...',
    'железный человек': 'Какая у тебя супер-сила? — Я тестировщик',
    'росомаха': 'Ведь никто никогда не узнает, кто спас прод. — Они знают. Это был Тестировщик',
    'терминатор': 'Все хотят быть тестировщиками, а он, кажется, просто хотел быть человеком.',
    'дедпул': 'Для того, чтобы завоевать девчонку, не нужно быть тестировщиком. Правильная девчонка сама разбудит его в тебе.',
    'человек паук': 'Знаешь, чем отличается простой тестировщик  от крутого тестировщика? Спецэффектами.',
    'капитан америка': 'Даже супергерои в день релиза, волнуются.',
    'флеш': 'И так всю жизнь: нашел все баги — потерял девушку.',
    'сорвиголова': 'Днём я обычный студент, а ночью я выхожу на борьбу с багами в костюме из латекса.',
}

# обработчик команды '/start'
@bot.message_handler(commands=['start'])
def start_command_handler(message: types.Message):
    # отправляем ответ на команду '/start'
    bot.send_message(
        chat_id=message.chat.id, # id чата, в который необходимо направить сообщение
        text= f'Привет,  {message.from_user.first_name}. Я расскажу тебе все супергеройские фразочки настоящего QA Engineer 🤓\nВведи имя супергероя, например, бетмен, тор или терминатор', # текст сообщения
    )

# обработчик всех остальных сообщений
@bot.message_handler()
def message_handler(message: types.Message):
    # пробуем найти ключевую фразу в словаре
    definition = DEFINITOINS.get(
        message.text.lower(), # приводим текст сообщения к нижнему регистру
    )
    # если фразы нет в словаре, то переменная definition будет иметь значение None
    # проверяем это условие
    if definition is None:
        # если ключевая фраза не была найдена в словаре
        # отправляем ответ
        bot.send_message(
            chat_id=message.chat.id,
            text='😋 Тебе еще нельзя такое читать',
        )
        # выходим из функции
        return
    
    # если ключевая фраза была найдена, формируем текст сообщения и отправляем его
    # если перед строкой поставить букву f, то в фигурных скобках {} можно использовать переменные :)
    bot.send_message(
        chat_id=message.chat.id,
        text=f'Великая цитата:\n{definition}',
    )

    bot.send_message(
        chat_id=message.chat.id,
        text=f'Попробуй еще',
    )


# главная функция программы
def main():
    # запускаем нашего бота
     bot.infinity_polling()


if __name__ == '__main__':
    main()
